app/controllers/birds_controller.rb

    def index
        @birds = Bird.all
---
SELECT "birds".* FROM "birds"

    def show
        @bird = Bird.find(params[:id])
---
SELECT "birds".* FROM "birds" WHERE "birds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @bird = Bird.create({name: params[:name], color: params[:color]})
---
INSERT INTO "birds" ("name", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Tucan Sam"], ["color", "Green"], ["created_at", "2020-07-15 19:39:54.171757"], ["updated_at", "2020-07-15 19:39:54.171757"]]